src/export-files/Documents/СправкаОбОбучении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СправкаОбОбучении</Name>
			<BasedOn>
				<xr:Item>Catalog.Студенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предоставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДтПд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальностьСтудента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриказОДвиженииКонтингета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФинансирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсСтудента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписывающийСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПодписывающего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/export-files/Enums/ФормыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ФормыОбучения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Очная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчноЗаочная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/export-files/Documents/СправкаОбОбучении/Ext/ManagerModule.bsl
Процедура ПечатьСправкиОбОбучении(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСправкиОбОбучении)
	Макет = Документы.СправкаОбОбучении.ПолучитьМакет("ПечатьСправкиОбОбучении");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправкаОбОбучении.ДатаОкончанияОбучения КАК ДатаОкончанияОбучения,
	|	СправкаОбОбучении.УчебнаяГруппа КАК ГруппаСтудента,
	|	СправкаОбОбучении.Номер КАК Номер,
	|	СправкаОбОбучении.Дата КАК Дата,
	|	СправкаОбОбучении.ВидФинансирования КАК ВидФинансирования,
	|	СправкаОбОбучении.ГодПоступления КАК ГодПоступления,
	|	СправкаОбОбучении.ДатаРождения КАК ГодРождения,
	|	СправкаОбОбучении.ДолжностьПодписывающего КАК Должность,
	|	СправкаОбОбучении.КурсСтудента КАК Курс,
	|	СправкаОбОбучении.Организация КАК НаименованиеОрганизации,
	|	СправкаОбОбучении.ПодписывающийСотрудник КАК ФИОПодписывающего,
	|	СправкаОбОбучении.Приказ КАК НомерПриказа,
	|	СправкаОбОбучении.СпециальностьСтудента КАК Специальность,
	|	СправкаОбОбучении.ФормаОбучения КАК ФормаОбучения,
	|	СправкаОбОбучении.ФИОДтПд КАК ФИО
	|ИЗ
	|	Документ.СправкаОбОбучении КАК СправкаОбОбучении
	|ГДЕ
	|	СправкаОбОбучении.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьТелоСправки = Макет.ПолучитьОбласть("ТелоСправки");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=D");
		ТабДок.Вывести(ОбластьЗаголовок, Выборка.Уровень());
		
		ОбластьТелоСправки.Параметры.Заполнить(Выборка);
		ОбластьТелоСправки.Параметры.НомерПриказа = Выборка.НомерПриказа.Номер + " от " + Формат(Выборка.НомерПриказа.Дата, "ДЛФ=DD");
		ОбластьТелоСправки.Параметры.ГодРождения = Формат(Выборка.ГодРождения, "ДФ=yyyy");
		ОбластьТелоСправки.Параметры.Образование = НРег(Выборка.ГруппаСтудента.ПрограммаОбучения.БазовоеОбразование);
		
		Если Выборка.ФормаОбучения = Перечисления.ФормыОбучения.Очная Тогда
			ОбластьТелоСправки.Параметры.ФормаОбучения = "очного";
		ИначеЕсли Выборка.ФормаОбучения = Перечисления.ФормыОбучения.Заочная Тогда
			ОбластьТелоСправки.Параметры.ФормаОбучения = "заочного";
		ИначеЕсли Выборка.ФормаОбучения = Перечисления.ФормыОбучения.ОчноЗаочная Тогда
			ОбластьТелоСправки.Параметры.ФормаОбучения = "очно-заочного";
		КонецЕсли;

		Если Выборка.ВидФинансирования = Перечисления.ВидыФинансирования.БюджетноеФинансирование Тогда
			ОбластьТелоСправки.Параметры.ВидФинансирования = "бюджетной";
		ИначеЕсли Выборка.ВидФинансирования = Перечисления.ВидыФинансирования.КоммерческоеФинансирование Тогда
			ОбластьТелоСправки.Параметры.ВидФинансирования = "коммерческой";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаОкончанияОбучения) Тогда
			ОбластьТелоСправки.Параметры.ОкончаниеОбучения = "Предполагаемая дата окончания обучения " + Формат(Выборка.ДатаОкончанияОбучения, "ДЛФ=DD");
		КонецЕсли;
		

		ОбластьТелоСправки.Параметры.Специальность = Выборка.Специальность;

		ТабДок.Вывести(ОбластьТелоСправки, Выборка.Уровень());

		ОбластьПодписи.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПодписи, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
	
КонецПроцедуры
